---
title: DWFImportOptions
classe: Autodesk.Revit.DB.DWFImportOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DWFImportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `dWFImportOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `dWFImportOptions.Dispose()` | Void |
| `IList<ElementId> GetSheetViews()` | `dWFImportOptions.GetSheetViews()` | IList<ElementId> |
| `Void SetSheetViews(IList<ElementId>)` | `dWFImportOptions.SetSheetViews(sheetViews)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```